html/tips-for-work-life-balance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tips for work-life balance</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Tips for work-life balance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Explicitly acknowledge priorities 健康, 快乐, 家庭永远是第一位</a></li>
<li><a href="#sec-2">2. Avoid workaholism 不要成为工作狂</a></li>
<li><a href="#sec-3">3. Avoid perfectionism 避免完美主义</a></li>
<li><a href="#sec-4">4. Set and enforce boundaries 设置和强化工作/生活边界</a></li>
<li><a href="#sec-5">5. Avoid over-commitment 避免过度承诺</a></li>
<li><a href="#sec-6">6. Use a work-flow system (GTD)</a></li>
<li><a href="#sec-7">7. Communicate 与家人沟通</a></li>
<li><a href="#sec-8">8. Keep hobbies (译注: 学会找乐子)</a></li>
<li><a href="#sec-9">9. Exploit opportunity cost 利用机会成本</a></li>
<li><a href="#sec-10">10. Continuously adapt 持续不断地适应(balance)</a></li>
</ul>
</div>
</div>
<p>
<a href="http://matt.might.net/articles/work-life-balance/">http://matt.might.net/articles/work-life-balance/</a>
</p>

<p>
My high-level tips are to:
</p>
<ul class="org-ul">
<li>Explicitly acknowledge priorities
</li>
<li>Avoid workaholism
</li>
<li>Avoid perfectionism
</li>
<li>Set and enforce boundaries
</li>
<li>Avoid over-commitment
</li>
<li>Use a work-flow system
</li>
<li>Communicate
</li>
<li>Keep hobbies
</li>
<li>Exploit opportunity cost
</li>
<li>Continuously adapt
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Explicitly acknowledge priorities 健康, 快乐, 家庭永远是第一位</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Start by listing your priorities in life.
</p>

<p>
If factors like "health", "happiness", or "family" rank below professional goals, your long-term priorities are not stable.
</p>

<p>
It is too easy to implicitly prioritize work ahead of everything else.
</p>

<p>
If those inverted priorities persist, a crisis&#x2013;injury/sickness, depression or divorce&#x2013;is inevitable.
</p>

<p>
The first step in avoiding (or resolving) a crisis is to explicitly acknowledge your priorities.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Avoid workaholism 不要成为工作狂</h2>
<div class="outline-text-2" id="text-2">
<p>
应该通过提高效率来减少工作时间
</p>

<blockquote>
<p>
The "work more; sleep less" mentality is misguided.
</p>

<p>
To be clear, I'm not advocating getting any less work done.
</p>

<p>
I'm not necessarily arguing for working fewer hours either.
</p>

<p>
Rather, I advocate efficiency.
</p>

<p>
I've observed the "work more; sleep less" types in many professions. They brag about working late nights and long weekends.
</p>

<p>
The equation for work is: <b>output = unit of work / hour × hours worked</b> "Work more, sleep less" people tend to focus too much on the hours worked part of the equation.
</p>

<p>
The unit of work / hour part of the equation&#x2013;productivity&#x2013;is just as (if not more) important.
</p>

<p>
The book <a href="http://www.amazon.com/gp/product/0307463745/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=0307463745&linkCode=as2&tag=ucmbread-20">Rework</a> by Jason Fried and David Heinemeier Hansson does an excellent job debunking the necessity of "work more; sleep less."
</p>

<p>
Hacking productivity boosts your maximum theoretical output.
</p>

<p>
When crunch time hits for a "work more; sleep less" individual, he stresses and panics. He cannot throttle up on output. He is at capacity.
</p>

<p>
When crunch time hits for a high-efficiency individual, her output skyrockets, because she can ramp up the hours worked part of the equation.
</p>

<p>
<b>Are you a workaholic?</b>
When you talk to colleagues about work, do you talk about what you didn't do&#x2013;didn't sleep, didn't eat, didn't go to the movies, didn't watch TV?
</p>

<p>
Or, do you talk about what you did&#x2013;shipped a grant proposal, wrote a manuscript, explored a new idea, gave a great lecture?
</p>

<p>
If you emphasize the things you sacrifice over the things you accomplish, perhaps you're too focused on one part of the work equation.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Avoid perfectionism 避免完美主义</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>应该将完美看做一个过程而不是目的
</li>
<li>你会因为不原意delegation而使得workload膨胀许.
</li>
<li>它将吞噬你的时间, 而这部分时间已经不能产生任何回报.
</li>
<li>你恰好要做的, 就是用这段时间来balance.
</li>
</ul>

<blockquote>
<p>
It is good to use perfection as a guide, but recognize that it is unattainable.
</p>

<p>
Perfection is a process; not a destination.
</p>

<p>
Iterate toward perfection but launch once you pass "good enough."
</p>

<p>
Perfectionism inflates your workload by preventing delegation.
</p>

<p>
It also sinks time into work well past the point of diminishing returns.
</p>

<p>
That is time you could have spent on balance.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Set and enforce boundaries 设置和强化工作/生活边界</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
Maintaining work-life balance require setting boundaries.
</p>

<p>
If necessary, it requires harshly enforcing those boundaries.
</p>

<p>
For example, my home router disables internet access for my laptop after 6:30pm and before 8:00am.
</p>

<p>
It allows a 30-minute reprieve at 5:30am and 9:30am for quick synchronization with email and repositories.
</p>

<p>
If you're having a meal, put your phone away or turn it off.
</p>

<p>
If you must, schedule recurring "life" time into your calendar, and set reminders/alarms.
</p>

<p>
Harsh boundaries sting when first enforced, but as you grow to accept and appreciate them, you will force yourself to get your work done around them.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Avoid over-commitment 避免过度承诺</h2>
<div class="outline-text-2" id="text-5">
<blockquote>
<p>
It takes a few minutes to entangle yourself in commitments that can take years to unwind.
</p>

<p>
Learn when and how to say "no."
</p>

<p>
If you're over-committed, say, "I'd really like to take on that task/role, but I'm concerned that with my current commitments, I might not be able to perform the this task to the high standards to which I hold myself."
</p>

<p>
Before you say "yes" to anything, sleep on it.
</p>

<p>
If you find yourself over-committed, start delegating, canceling, recusing and refusing.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Use a work-flow system (GTD)</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Communicate 与家人沟通</h2>
<div class="outline-text-2" id="text-7">
<blockquote>
<p>
In a family or a relationship, every member needs to know the stress level and work load of every other member.
</p>

<p>
A shared calendar system like Google calendar helps with implicit communication of stress level.
</p>

<p>
I also created a web app for my wife that graphs my inbox size over time. Any upward deviation indicates an increase in stress.
</p>

<p>
It is also important to maintain explicit, dispassionate communication of stress level: if you're stressed or becoming stressed, warn your family.
</p>

<p>
They may be able to adapt or help you compensate for short periods if you communicate your needs.
</p>

<p>
Relying on telepathy is the most efficient way to doom a good relationship.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Keep hobbies (译注: 学会找乐子)</h2>
<div class="outline-text-2" id="text-8">
<blockquote>
<p>
Even if you love your work (as many in my profession do), it is important to have hobbies outside of work.
</p>

<p>
Even the best jobs create stress.
</p>

<p>
Hobbies are a way of letting stress go before it explodes.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Exploit opportunity cost 利用机会成本</h2>
<div class="outline-text-2" id="text-9">
<p>
计算机会成本, 尽量只做喜欢的事情.
</p>

<blockquote>
<p>
Decide on a list of essential personal tasks.
</p>

<p>
If you have a partner, split them up.
</p>

<p>
Each should claim preferred tasks.
</p>

<p>
For the remaining unwanted tasks, divide them evenly or consider hiring someone to do them.
</p>

<p>
For every task, ask whether it is worth your time to do it, given how else you could spend that time.
</p>

<p>
For example, while I'm capable of cutting the lawn each week, I don't enjoy it, and my time is better spent on research, writing a blog post or playing with my kids. So, we hired a neighborhood college student to cut our lawn.
</p>

<p>
Or, for instance, if you don't like to clean (or would better utilize that time on another task), consider a home-cleaning service.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Continuously adapt 持续不断地适应(balance)</h2>
<div class="outline-text-2" id="text-10">
<blockquote>
<p>
Realize you won't always strike the right balance.
</p>

<p>
You will make mistakes.
</p>

<p>
That's okay.
</p>

<p>
Listen to your partner and if they're not satisfied, take action. Move the boundaries; change your habits; or reduce your workload.
</p>

<p>
Recognize that achieving work-life balance is a never-ending process.
</p>

<p>
Don't treat the balance in "work-life balance" like a noun.
</p>

<p>
Treat it like a verb.
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>
